app/views/people/index.html.erb

    <%ses_id=session[:user_id]
    user_house_id=Person.find(ses_id).household_id%>
---
SELECT  "households".* FROM "households" WHERE "households"."id" = $1 LIMIT 1  [["id", 3]]