app/views/people/show.html.erb

                <p style="font-size: 22px;"><%if @people.household_id%>
                                        <%=Household.find(@people.household_id).name%><%end%></p>
---
SELECT  "households".* FROM "households" WHERE "households"."id" = $1 LIMIT 1  [["id", 3]]

            <div class="col-md-4" style="text-align:center; padding-right: 15px;">
                <p style="font-size: 12px;"><%Chore.all.each do |chore|%>
---
SELECT "chores".* FROM "chores"