app/controllers/chores_controller.rb

SELECT "chores".* FROM "chores"
---
    def index
        @chores = Chore.all