app/controllers/chores_controller.rb

SELECT COUNT(*) FROM "chores"
---
    def index
        @chores = Chore.order(:household_id).page(params[:page]).per_page(50)

SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT 1  [["id", 2]]
---
    def show
        id = params[:id]
        @chores = Chore.find(params[:id])

INSERT INTO "chores" ("task", "priority", "person_assigned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["task", "sweep"], ["priority", "low"], ["person_assigned", "random"], ["created_at", "2017-11-21 15:59:45.720976"], ["updated_at", "2017-11-21 15:59:45.720976"]]
UPDATE "chores" SET "status" = $1, "updated_at" = $2 WHERE "chores"."id" = $3  [["status", "uncompleted"], ["updated_at", "2017-11-22 00:15:31.990639"], ["id", 10]]
---
    def create
        @chores = Chore.create(chore_params)
        house_id=Person.find(session[:user_id]).household_id
        @chores.update(:household_id => house_id)

SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "chores" SET "last_accomplished" = $1, "updated_at" = $2 WHERE "chores"."id" = $3  [["last_accomplished", "2017-12-07 19:40:38.000000"], ["updated_at", "2017-12-07 19:40:41.398676"], ["id", 58]]
---
    def update
       @chores = Chore.find params[:id]
       @chores.update_attributes(chore_params)

SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "chores" WHERE "chores"."id" = $1  [["id", 9]]
---
    def destroy
        @chores = Chore.find params[:id]
        @chores.destroy