app/controllers/households_controller.rb

    def index
        @households = Household.order(:name).page(params[:page]).per_page(5)
---
SELECT  "households".* FROM "households"  ORDER BY "households"."name" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "households"

    def show
        id = params[:id]
        @households = Household.find(params[:id])
---
SELECT  "households".* FROM "households" WHERE "households"."id" = $1 LIMIT 1  [["id", 1]]

    def create
        @households = Household.create(household_params)
---
INSERT INTO "households" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Household"], ["created_at", "2017-11-21 15:59:22.016560"], ["updated_at", "2017-11-21 15:59:22.016560"]]