app/controllers/households_controller.rb

    def index
        @households = Household.all
---
SELECT "households".* FROM "households"