app/controllers/people_controller.rb

INSERT INTO "people" ("first_name", "last_name", "password_digest", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @people = Person.create(people_params)

UPDATE "people" SET "first_name" = $1, "last_name" = $2, "description" = $3, "updated_at" = $4 WHERE "people"."id" = $5  [["first_name", "Mackenna"], ["last_name", "Barker"], ["description", ""], ["updated_at", "2017-12-07 05:42:30.814224"], ["id", 1]]
---
    def update
        @people = Person.find(params[:id])
        #check to make sure person is updating their own profile only
        if Person.find(session[:user_id]) != @people
           flash[:notice] = "Access Denied"
        else
            @people.update_attributes(people_params)