app/views/chores/index.html.erb

SELECT  "households".* FROM "households" WHERE "households"."id" = $1 LIMIT 1  [["id", 1]]
---
    <%ses_id=session[:user_id]
    ses_house_id=Person.find(ses_id).household_id